app/Controllers/Cart.php

SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
WHERE `a`.`productID` = 'assets'
---
    public function details($id)
    {
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->WHERE('a.productID',$id);
        $products = $builder->get()->getResult();