app/Controllers/Customer.php

    public function Dashboard()
    {
        $user = session()->get('sess_id');
        //services
        $builder = $this->db->table('tblreservation');
        $builder->select('*');
        $builder->WHERE('customerID',$user)->WHERE('Status',0);
        $book = $builder->get()->getResult();
        //orders
        $builder = $this->db->table('tblorders a');
        $builder->select('a.productName,a.Qty,a.price');
        $builder->join('tblcustomer_order b','b.TransactionNo=a.TransactionNo','LEFT');
        $builder->WHERE('a.customerID',$user)->WHERE('b.Status',1);
        $order = $builder->get()->getResult();
---
SELECT *
FROM `tblcustomer_order`
WHERE `customerID` = '1'
SELECT *
FROM `tblreservation`
WHERE `customerID` = '4'

    public function viewOrder()
    {
        $val = $this->request->getGet('value');
        $builder = $this->db->table('tblorders');
        $builder->select('*');
        $builder->WHERE('TransactionNo',$val);
        $data = $builder->get();
        ?>
        <table class="table table-bordered table-stripe hover nowrap">
            <thead>
                <th>Product Name</th>
                <th>Qty</th>
                <th>Price</th>
            </thead>
        <?php
        foreach($data->getResult() as $row)
        {
            ?>
            <tr>
                <td><?php echo $row->productName ?></td>
                <td><?php echo $row->Qty ?></td>
                <td style="text-align:right;"><?php echo number_format($row->price,2) ?></td>
            </tr>
            <?php
        }
        $builder = $this->db->table('tblorders');
        $builder->select('SUM(Qty)Qty,SUM(price)total');
        $builder->WHERE('TransactionNo',$val);
        $builder->groupBy('TransactionNo');
        $datas = $builder->get();
---
SELECT *
FROM `tblorders`
WHERE `TransactionNo` = '0000009'
SELECT SUM(Qty)Qty, SUM(price)total
FROM `tblorders`
WHERE `TransactionNo` = '0000009'
GROUP BY `TransactionNo`

    public function editPet($id=null)
    {
        $builder = $this->db->table('tblpets');
        $builder->select('*');
        $builder->WHERE('petsID',$id);
        $pets = $builder->get()->getResult();
---
SELECT *
FROM `tblpets`
WHERE `petsID` = 'vendors'