app/Controllers/Customer.php

    public function viewOrder()
    {
        $val = $this->request->getGet('value');
        $builder = $this->db->table('tblorders');
        $builder->select('*');
        $builder->WHERE('TransactionNo',$val);
        $data = $builder->get();
        ?>
        <table class="table table-bordered table-stripe hover nowrap">
            <thead>
                <th>Product Name</th>
                <th>Qty</th>
                <th>Price</th>
            </thead>
        <?php
        foreach($data->getResult() as $row)
        {
            ?>
            <tr>
                <td><?php echo $row->productName ?></td>
                <td><?php echo $row->Qty ?></td>
                <td style="text-align:right;"><?php echo number_format($row->price,2) ?></td>
            </tr>
            <?php
        }
        $builder = $this->db->table('tblorders');
        $builder->select('SUM(Qty)Qty,SUM(price)total');
        $builder->WHERE('TransactionNo',$val);
        $builder->groupBy('TransactionNo');
        $datas = $builder->get();
---
SELECT *
FROM `tblorders`
WHERE `TransactionNo` = '0000001'