app/Controllers/Customer.php

SELECT *
FROM `tblpets`
WHERE `petsID` = 'vendors'
---
    public function editPet($id=null)
    {
        $builder = $this->db->table('tblpets');
        $builder->select('*');
        $builder->WHERE('petsID',$id);
        $pets = $builder->get()->getResult();

SELECT *
FROM `tblorders`
WHERE `customerID` = '1'
AND `Status` = 0
SELECT SUM(Qty*price)total
FROM `tblorders`
WHERE `customerID` = '1'
AND `Status` = 0
---
    public function shipping()
    {
        $user = session()->get('sess_id');
        $builder = $this->db->table('tblorders');
        $builder->select('*');
        $builder->WHERE('customerID',$user)->WHERE('Status',0);
        $items = $builder->get()->getResult();
        //total
        $builder = $this->db->table('tblorders');
        $builder->select('SUM(Qty*price)total');
        $builder->WHERE('customerID',$user)->WHERE('Status',0);
        $total = $builder->get()->getResult();

SELECT *
FROM `tblcustomer_info` `a`
WHERE `customerID` = '1'
---
    public function fetchInfo()
    {
        $user = session()->get('sess_id');
        $builder = $this->db->table('tblcustomer_info a');
        $builder->select('*');
        $builder->WHERE('customerID',$user);
        $data = $builder->get();