app/Controllers/Home.php

SELECT *
FROM `tblaccount`
WHERE `username` = 'admin'
AND `Status` = 1
---
    public function Authentication()
    {
        $logsModel = new \App\Models\logsModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $validation = $this->validate([
            'username'=>'required',
            'password'=>'min_length[8]|max_length[12]'
        ]);
        if(!$validation)
        {
            session()->setFlashdata('fail','Invalid Username or Password!');
            return redirect()->to('/auth')->withInput();
        }
        else
        {
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('username',$username)->WHERE('Status',1);
            $data = $builder->get();

SELECT `a`.`Status` as `Remarks`, `a`.`DateCreated`, `a`.`TransactionNo`, `a`.`Firstname`, `a`.`Surname`, `a`.`Address`, `a`.`Email`, `a`.`contactNumber`, `b`.`Status`, `b`.`PaymentMethod`, `b`.`Total`, `b`.`paymentID`
FROM `tblcustomer_order` `a`
LEFT JOIN `tblpayment` `b` ON `b`.`TransactionNo`=`a`.`TransactionNo`
GROUP BY `a`.`OrderNo`
---
    public function Orders()
    {
        $builder = $this->db->table('tblcustomer_order a');
        $builder->select('a.Status as Remarks,a.DateCreated,a.TransactionNo,a.Firstname,a.Surname,a.Address,a.Email,a.contactNumber,
        b.Status,b.PaymentMethod,b.Total,b.paymentID');
        $builder->join('tblpayment b','b.TransactionNo=a.TransactionNo','LEFT');
        $builder->groupBy('a.OrderNo');
        $order = $builder->get()->getResult();

SELECT *
FROM `tblblog`
ORDER BY `blogID` DESC
 LIMIT 5
---
    public function read()
    {
        $builder = $this->db->table('tblblog');
        $builder->select('*');
        $builder->orderby('blogID','DESC')->limit(5);
        $data = $builder->get();

SELECT `a`.*, `b`.`Fullname`
FROM `tblblog` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
ORDER BY `a`.`blogID` DESC
 LIMIT 3
---
    public function index()
    {
        $builder = $this->db->table('tblblog a');
        $builder->select('a.*,b.Fullname');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $builder->orderBy('a.blogID','DESC')->limit(3);
        $blog = $builder->get()->getResult();

SELECT `a`.*, `b`.`Fullname`
FROM `tblblog` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
ORDER BY `a`.`blogID` DESC
 LIMIT 3
---
    public function membership()
    {
        $builder = $this->db->table('tblblog a');
        $builder->select('a.*,b.Fullname');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $builder->orderBy('a.blogID','DESC')->limit(3);
        $blog = $builder->get()->getResult();

SELECT `a`.*, `b`.`Fullname`
FROM `tblblog` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
ORDER BY `a`.`blogID` DESC
 LIMIT 3
---
    public function post($id=null)
    {
        $builder = $this->db->table('tblblog');
        $builder->select('*');
        $builder->WHERE('blogTitle',$id);
        $story = $builder->get()->getResult();
        //blogs
        $builder = $this->db->table('tblblog a');
        $builder->select('a.*,b.Fullname');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $builder->orderBy('a.blogID','DESC')->limit(3);
        $blog = $builder->get()->getResult();