app/Controllers/Home.php

    public function Orders()
    {
        $builder = $this->db->table('tblcustomer_order a');
        $builder->select('a.Status as Remarks,a.DateCreated,a.TransactionNo,a.Firstname,a.Surname,a.Address,a.Email,a.contactNumber,
        b.Status,b.PaymentMethod,b.Total,b.paymentID');
        $builder->join('tblpayment b','b.TransactionNo=a.TransactionNo','LEFT');
        $builder->groupBy('a.OrderNo');
        $order = $builder->get()->getResult();
---
SELECT `a`.`Status` as `Remarks`, `a`.`DateCreated`, `a`.`TransactionNo`, `a`.`Firstname`, `a`.`Surname`, `a`.`Address`, `a`.`Email`, `a`.`contactNumber`, `b`.`Status`, `b`.`PaymentMethod`, `b`.`Total`, `b`.`paymentID`
FROM `tblcustomer_order` `a`
LEFT JOIN `tblpayment` `b` ON `b`.`TransactionNo`=`a`.`TransactionNo`
GROUP BY `a`.`OrderNo`

    public function loadProducts()
    {
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->groupBy('a.productID');
        $data = $builder->get();
---
SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
GROUP BY `a`.`productID`

    public function filterCategoryProducts()
    {
        $val = $this->request->getGet('value');
        if($val=="All")
        {
            $builder = $this->db->table('tblproduct a');
            $builder->select('a.*,b.CategoryName');
            $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
            $builder->groupBy('a.productID');
            $data = $builder->get();
---
SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
GROUP BY `a`.`productID`