app/Controllers/Home.php

SELECT *
FROM `tblaccount`
SELECT `a`.`Title`, `a`.`Description`, `a`.`Charge`, `a`.`feeID`
FROM `tblfee` `a`
SELECT `a`.*, `b`.`Title`
FROM `tbldiscount` `a`
LEFT JOIN `tblfee` `b` ON `b`.`feeID`=`a`.`feeID`
SELECT *
FROM `tblservices`
---
    public function Maintenance()
    {
        if(session()->get('sess_role')!="Administrator")
        {
            return redirect()->back();
        }
        else
        {
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $account = $builder->get()->getResult();
            //fee
            $builder = $this->db->table('tblfee a');
            $builder->select('a.Title,a.Description,a.Charge,a.feeID');
            $fee = $builder->get()->getResult();
            //discount
            $builder = $this->db->table('tbldiscount a');
            $builder->select('a.*,b.Title');
            $builder->join('tblfee b','b.feeID=a.feeID','LEFT');
            $discount = $builder->get()->getResult();
            //services
            $builder = $this->db->table('tblservices');
            $builder->select('*');
            $services = $builder->get()->getResult();

SELECT `a`.*, `b`.`Image`
FROM `tblproduct` `a`
LEFT JOIN `tblproductimage` `b` ON `b`.`productID`=`a`.`productID`
GROUP BY `a`.`productID`
---
    public function allProducts()
    {
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.Image');
        $builder->join('tblproductimage b','b.productID=a.productID','LEFT');
        $builder->groupBy('a.productID');
        $product = $builder->get()->getResult();