app/Controllers/Report.php

    public function servicesIncome()
    {
        $from = $this->request->getGet('from');
        $to = $this->request->getGet('to');


        $stat = [1,3];
        $builder = $this->db->table('tblreservation');
        $builder->select('servicesName,SUM(TotalAmount)Total');
        $builder->WHEREIN('Status',$stat)->WHERE('Date >=',$from)->WHERE('Date <=',$to);
        $builder->groupBy('servicesName');
        $data = $builder->get();
---
SELECT `servicesName`, SUM(TotalAmount)Total
FROM `tblreservation`
WHERE `Status` IN (1,3)
AND `Date` >= '2023-11-01'
AND `Date` <= '2023-12-31'
GROUP BY `servicesName`